{
    "# Syncing with AnkiWeb <!-- toc --> AnkiWeb is a service that allows you to keep your collection synchronized across multiple devices, and to study online. Please sign up for a [free account](https://ankiweb.net/) before following the steps below. ## Intro Videos For a quick introduction to syncing, please check out the [syncing intro videos](https://www.youtube.com/watch?v=YkiM4DPzSVc&list=PLGgmaKOIHykFoomqkBJAyGiDQ2kyiuTao&yt:cc=on). ## Setup To start syncing your collection across devices, click the sync button (the top right one on the [main screen](studying.md#decks), or press 'y' on your keyboard. You’ll be prompted for your AnkiWeb ID and password, which you created in the signup process. When you synchronize your collection for the first time, Anki will ask you if you want to upload or download. If you have cards on your computer and your AnkiWeb account is empty, choose \"upload\" to send your data to AnkiWeb.": "# AnkiWeb과 동기화하기\nAnkiWeb은 여러 기기에서 컬렉션을 동기화하고 온라인으로 공부할 수 있는 서비스입니다. 아래 단계를 따르기 전에 [무료 계정](https://ankiweb.net/)에 가입해주세요.\n\n## 소개 동영상\n동기화에 대한 간단한 소개를 보려면 [동기화 소개 동영상](https://www.youtube.com/watch?v=YkiM4DPzSVc&list=PLGgmaKOIHykFoomqkBJAyGiDQ2kyiuTao&yt:cc=on)을 확인해주세요.\n\n## 설정\n여러 기기에서 컬렉션을 동기화하려면 [메인 화면](studying.md#decks)의 오른쪽 위에 있는 동기화 버튼을 클릭하거나 키보드에서 'y'를 눌러주세요. 가입 과정에서 생성한 AnkiWeb ID와 비밀번호를 입력하라는 메시지가 표시됩니다. 처음으로 컬렉션을 동기화할 때 Anki는 데이터를 업로드할지 다운로드할지 묻습니다. 만약 컴퓨터에 카드가 있고 AnkiWeb 계정이 비어 있다면, 데이터를 AnkiWeb으로 보내기 위해 \"업로드\"를 선택해주세요.",
    " If you have cards on AnkiWeb from another device, and no cards on your computer, choose \"download\" to replace the empty local collection with the cards that are on AnkiWeb. If you have different cards on both devices, [more work is required](#merging-conflicts) to avoid losing data. Once the initial one way sync is completed, Anki will be able to merge changes from multiple locations with a few exceptions. If you have multiple people using Anki on one machine and have created a profile for each user, each user will need to create their own AnkiWeb account to sync with. If you attempt to synchronize multiple profiles with a single AnkiWeb account, you will lose data. ## Automatic Syncing Once syncing is enabled, Anki will automatically sync each time your collection is closed or opened. If you would prefer to synchronize manually, you can disable automatic syncing in Anki’s [preferences.](preferences.": "만약 다른 기기에서 AnkiWeb에서 카드를 가지고 있고, 컴퓨터에는 카드가 없다면, \"다운로드\"를 선택하여 비어있는 로컬 컬렉션을 AnkiWeb의 카드로 대체하세요. 두 기기에서 서로 다른 카드를 가지고 있다면, 데이터를 잃지 않도록 [충돌 병합](#merging-conflicts)이 필요합니다. 초기 단방향 동기화가 완료되면, Anki는 몇 가지 예외를 제외하고 여러 위치에서 발생한 변경 사항을 병합할 수 있게 될 것입니다. 한 컴퓨터에서 Anki를 사용하는 여러 사람이 각자의 프로필을 만들었고, 각 사용자가 동기화를 위해 자신의 AnkiWeb 계정을 만들어야 합니다. 하나의 AnkiWeb 계정으로 여러 프로필을 동기화하려고 시도하면 데이터를 잃게 됩니다. ## 자동 동기화 동기화가 활성화된 경우, Anki는 컬렉션이 닫히거나 열릴 때마다 자동으로 동기화됩니다. 수동으로 동기화하고 싶다면, Anki의 [환경 설정](환경설정)에서 자동 동기화를 비활성화할 수 있습니다.",
    "md#syncing) ## Button Color The sync button will change to blue when a normal sync is required, and red when a full sync is required. ## Media Related video: <https://www.youtube.com/watch?v=phP9GGG-PxY> Anki will synchronize any sounds and images used by your notes. It will notice when media has been added or removed from your [media folder](files.md#file-locations), but will not notice if you have edited some existing files without adding or removing any. To get your edits noticed, you need to add or remove a file as well. One-way syncs (where you're prompted to upload or download) have no influence over how media syncs - media changes are always merged. To prevent accidental data loss, deletions will only sync to other devices if they are made after media is fully in sync. If you delete files before your device is fully in sync, and the deleted files are already on AnkiWeb, they will be downloaded the next time you sync. If you’re running Anki off a [USB flash drive](files.": "md #동기화) ## 버튼 색상 일반 동기화가 필요한 경우, 동기화 버튼은 파란색으로 변하고 전체 동기화가 필요한 경우 빨간색으로 변합니다. ## 미디어 관련 동영상: <https://www.youtube.com/watch?v=phP9GGG-PxY> Anki는 노트에서 사용된 모든 소리와 이미지를 동기화합니다. 미디어가 [미디어 폴더](files.md#file-locations)에서 추가되거나 제거되었을 때 이를 인지하지만, 기존 파일을 편집하고 추가 또는 제거하지 않은 경우에는 알지 못합니다. 변경 사항을 인지하려면 파일을 추가하거나 제거해야 합니다. 업로드 또는 다운로드하라는 메시지가 표시되는 일방향 동기화는 미디어 동기화에는 영향을 주지 않습니다. 미디어 변경 사항은 항상 병합됩니다. 우연한 데이터 손실을 방지하기 위해 삭제한 파일은 미디어가 완전히 동기화된 후에만 다른 기기로 동기화됩니다. 디바이스가 완전히 동기화되지 않은 상태에서 파일을 삭제하고 삭제된 파일이 이미 AnkiWeb에 있는 경우, 다음 동기화 시 파일이 다시 다운로드됩니다. [USB 플래시 드라이브](files.md)에서 Anki를 실행하는 경우,",
    "md#running-from-a-flash-drive), you should use an NTFS file system, as Anki may not be able to detect media changes on a FAT32 filesystem. ## Conflicts Related video: <https://www.youtube.com/watch?v=UEAcpfMQnjo> Under normal circumstances, reviews and note edits can be merged, so if you review or edit on two different devices before syncing, Anki will preserve your changes from both locations. If the same card has been reviewed in two different locations, both reviews will be marked in the revision history, and the card will be kept in the state it was when it was most recently answered. There are certain changes that Anki is unable to merge. These mainly relate to the format of notes: things like adding a new field, or removing a card template. When you perform an operation that can’t be merged, Anki will warn you, and give you the option of aborting the operation.": "md#플래시 드라이브에서 실행할 경우 NTFS 파일 시스템을 사용해야합니다. FAT32 파일 시스템에서는 Anki가 미디어 변경을 감지하지 못할 수 있습니다.##충돌 관련 비디오: <https://www.youtube.com/watch?v=UEAcpfMQnjo>정상적인 상황에서 리뷰 및 노트 편집은 병합될 수 있으므로, 동기화하기 전에 두 개의 다른 장치에서 리뷰 또는 편집을 수행하면 Anki가 양쪽 위치의 변경 사항을 보존합니다. 동일한 카드가 두 개의 다른 위치에서 리뷰되면, 리비전 기록에 모두 표시되며, 카드는 가장 최근에 대답한 시점의 상태로 유지됩니다. Anki가 병합할 수 없는 특정 변경 사항이 있습니다. 이는 주로 노트 형식과 관련된 것이며, 새로운 필드 추가 또는 카드 템플릿 제거와 같은 작업입니다. Anki가 병합할 수 없는 작업을 수행하면 경고 메시지가 표시되며 작업을 중단할 수 있는 옵션이 제공됩니다.",
    " If you choose to continue, you’ll be asked to choose whether to keep the local copy or the copy on AnkiWeb when your collection is next synchronized. If certain problems are detected while syncing, it will also force a one way sync. If you find this consistently happens, please post on our support site. When a one way sync is required, you need to choose whether you wish to keep the collection on your local device, or the collection on AnkiWeb. If changes have been made on both ends, only changes on one end can be preserved. If you choose Upload, the content on your local device will be sent to AnkiWeb. You then need to sync your other devices, and choose \"Download\" to have them grab a copy of that content. If you choose Download, it will replace any local changes you’ve made with the data that is on AnkiWeb. Once all devices are in sync, future syncs will return to the normal behaviour of merging changes from both ends.": "계속 진행하려면 컬렉션이 다음에 동기화 될 때 로컬 복사본 또는 AnkiWeb의 복사본을 유지할지 선택하도록 요청됩니다. 동기화하는 동안 특정 문제가 발견되면 강제로 일방향 동기화가 될 것입니다. 이러한 경우가 지속적으로 발생하면 지원 사이트에 게시해주시기 바랍니다. 일방향 동기화가 필요한 경우 로컬 장치의 컬렉션을 유지할지 AnkiWeb의 컬렉션을 유지할지 선택해야 합니다. 양쪽에서 변경 사항이 있을 경우 한 쪽에서만 변경 사항을 보존할 수 있습니다. 업로드를 선택하면 로컬 장치의 내용이 AnkiWeb으로 전송됩니다. 그런 다음 다른 장치를 동기화하고 해당 내용의 사본을 가져오기 위해 \"다운로드\"를 선택해야 합니다. 다운로드를 선택하면 AnkiWeb에 있는 데이터로 로컬에서 한 변경 사항을 대체합니다. 모든 장치가 동기화된 후에는 향후 동기화는 양쪽에서 변경 사항을 병합하는 일반 동작으로 돌아갑니다.",
    " If you wish to force a full upload or download (for example, because you accidentally deleted a deck on one side and want to restore the deck rather than having its deletion synchronized), you can check the \"On next sync, force changes in one direction\" box in Tools&gt;Preferences&gt;Network, then sync as usual. (You’ll be given the option to choose which side you want to use.) Forcing a one way sync only affects card syncing - media is synced as normal. If you have files that you want to remove from AnkiWeb, please ensure your client is fully in sync first. After syncing is up to date, any files you remove (e.g via the Check Media function) will be removed from AnkiWeb on the following sync. ## Merging Conflicts Because the [first sync](#setup) can only sync changes in one direction, if you have added different content to different devices or profiles before setting syncing up, content on one device will be lost if you overwrite it with the content from the other device.": "다음과 같이 번역해주세요.\n\n전체 업로드 또는 다운로드를 강제로 실행하려면 (예를 들어, 한 쪽의 덱을 실수로 삭제하고 삭제를 동기화하는 대신 덱을 복원하고 싶은 경우), 도구 > 기본사항 > 네트워크에서 \"다음 동기화에서 한 방향으로 변경 강제\" 상자를 체크하고 일반적으로 동기화를 진행하시면 됩니다. (어떤 쪽을 사용할지 선택할 수 있는 옵션이 제공됩니다.) 한 방향 동기화를 강제로 실행하면 카드 동기화에만 영향을 미치며 미디어는 정상적으로 동기화됩니다. AnkiWeb에서 제거하려는 파일이 있다면, 먼저 클라이언트가 완전히 동기화되었는지 확인해주세요. 동기화가 최신 상태인 후에 파일을 제거하면(예: 미디어 확인 기능을 통해), 다음 동기화 시에 AnkiWeb에서 해당 파일이 제거됩니다. ## 병합 충돌 [첫번째 동기화](#setup)는 한 방향으로만 변경사항을 동기화할 수 있으므로, 동기화를 설정하기 전에 다른 기기나 프로필에서 다른 콘텐츠를 추가한 경우, 한 기기의 콘텐츠가 다른 기기의 콘텐츠로 덮어쓰여지면 손실됩니다."
}